music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "band_id", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dfsa"], ["band_id", 10], ["year", 12], ["live", true], ["created_at", "2018-09-13 23:27:33.924568"], ["updated_at", "2018-09-13 23:27:33.924568"]]

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", true], ["updated_at", "2018-09-14 00:22:18.229821"], ["id", 5]]

  def destroy
    album = Album.find(params[:id])
    band = @album.band
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]