music_app/app/views/bands/index.html.erb

  <% @bands.each do |band| %>
    <li><a href="<%= band_url(Band.find(band.id)) %>"><%= band.name %></a></li>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]