music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 10]]
SELECT  1 AS one FROM "albums" WHERE "albums"."band_id" = $1 LIMIT $2  [["band_id", 10], ["LIMIT", 1]]
---

<% unless @band.albums.empty? %>